package test;

public class ElevatorVanilla {

	public static void main(String[] args) {
/*
엘리베이터 제어 프로그램 : 
		기능 : 
			1. 엘리베이터 작동
				1.1. 상승 > 눌려진 최고 층 수에 도달할 때까지 무조건 상승 유지
				1.2. 하강 > "
				1.3. 멈춤
			2. 문 작동
				2.1. 열림
					2.1.1. 열림 버튼
				2.2. 닫힘
					2.2.1. 닫힘 버튼
			4. 층 수 입력 받음
				4.1. 입력 받은 층 수 표시***
					StringBufferexample > append + 입력 + 공백으로 저장
											> 공백 기준 서치/트림
O			5. 현재 층수 표시
O				5.1. 상승, 하강 여부 표시***
				
			(6. 스피커
				6.1. 층 도착 알림
				6.2. 문 개폐 알림
				6.3. 상승/하강 알림)
				(7. 비상호출
					> 정지 + 관리실 호출 + 통화)
			출력 : ***

		입력 可한 타입 : only int
*/
	}
}